daas/esloadtestpostsearchsimulation30x1m-1481747252572/simulation.log
[INFO] Scanning for projects...
[WARNING] 
[WARNING] Some problems were encountered while building the effective model for com.datio.daas.testPF:testPF:jar:1.0-SNAPSHOT
[WARNING] 'build.plugins.plugin.(groupId:artifactId)' must be unique but found duplicate declaration of plugin net.alchim31.maven:scala-maven-plugin @ line 62, column 21
[WARNING] 'parent.relativePath' points at com.datio.daas:daas instead of com.stratio:parent, please verify your project structure @ line 24, column 13
[WARNING] 
[WARNING] It is highly recommended to fix these problems because they threaten the stability of your build.
[WARNING] 
[WARNING] For this reason, future Maven versions might no longer support building such malformed projects.
[WARNING] 
[INFO]                                                                         
[INFO] ------------------------------------------------------------------------
[INFO] Building testPF 1.0-SNAPSHOT
[INFO] ------------------------------------------------------------------------
[INFO] 
[INFO] --- maven-clean-plugin:2.5:clean (default-clean) @ testPF ---
[INFO] Deleting /home/david/workspace/daas/testPF/target
[INFO] 
[INFO] --- maven-resources-plugin:3.0.1:resources (default-resources) @ testPF ---
[INFO] Using 'UTF-8' encoding to copy filtered resources.
[INFO] skip non existing resourceDirectory /home/david/workspace/daas/testPF/src/main/resources
[INFO] 
[INFO] --- scala-maven-plugin:3.2.2:add-source (scala-compile-first) @ testPF ---
[INFO] Add Source directory: /home/david/workspace/daas/testPF/src/main/scala
[INFO] Add Test Source directory: /home/david/workspace/daas/testPF/src/test/scala
[INFO] 
[INFO] --- scala-maven-plugin:3.2.2:compile (scala-compile-first) @ testPF ---
[WARNING]  Expected all dependencies to require Scala version: 2.11.6
[WARNING]  com.datio.daas.testPF:testPF:1.0-SNAPSHOT requires scala version: 2.11.6
[WARNING]  io.gatling.highcharts:gatling-charts-highcharts:2.1.7 requires scala version: 2.11.7
[WARNING] Multiple versions of scala libraries detected!
[INFO] No sources to compile
[INFO] 
[INFO] --- maven-resources-plugin:3.0.1:copy-resources (copy-resources) @ testPF ---
[INFO] Using 'UTF-8' encoding to copy filtered resources.
[INFO] Copying 1 resource
[INFO] 
[INFO] --- maven-compiler-plugin:3.1:compile (default-compile) @ testPF ---
[INFO] No sources to compile
[INFO] 
[INFO] --- maven-resources-plugin:3.0.1:testResources (default-testResources) @ testPF ---
[INFO] Using 'UTF-8' encoding to copy filtered resources.
[INFO] Copying 3 resources
[INFO] 
[INFO] --- scala-maven-plugin:3.2.2:testCompile (scala-test-compile) @ testPF ---
[WARNING]  Expected all dependencies to require Scala version: 2.11.6
[WARNING]  com.datio.daas.testPF:testPF:1.0-SNAPSHOT requires scala version: 2.11.6
[WARNING]  io.gatling.highcharts:gatling-charts-highcharts:2.1.7 requires scala version: 2.11.7
[WARNING] Multiple versions of scala libraries detected!
[INFO] /home/david/workspace/daas/testPF/src/test/scala:-1: info: compiling
[INFO] Compiling 21 source files to /home/david/workspace/daas/testPF/target/test-classes at 1481747230553
[INFO] prepare-compile in 0 s
[INFO] compile in 5 s
[INFO] 
[INFO] --- maven-compiler-plugin:3.1:testCompile (default-testCompile) @ testPF ---
[INFO] Nothing to compile - all classes are up to date
[INFO] 
[INFO] --- maven-surefire-plugin:2.7:test (default-test) @ testPF ---
[INFO] Tests are skipped.
[INFO] 
[INFO] --- maven-jar-plugin:2.4:jar (default-jar) @ testPF ---
[WARNING] JAR will be empty - no content was marked for inclusion!
[INFO] Building jar: /home/david/workspace/daas/testPF/target/testPF-1.0-SNAPSHOT.jar
[INFO] 
[INFO] --- gatling-maven-plugin:2.1.7:execute (default) @ testPF ---
Simulation com.datiobd.daas.testPF.simulations.EsLoadTestPostSearchSimulation30x1m started...
[WARN] [12/14/2016 21:27:26.609] [Base-Simulation-akka.actor.default-dispatcher-3] [akka.actor.ActorSystemImpl(Base-Simulation)] Explicitly set HTTP header 'Content-Type: application/json' is ignored, illegal RawHeader
[WARN] [12/14/2016 21:27:26.715] [Base-Simulation-akka.actor.default-dispatcher-8] [akka.actor.ActorSystemImpl(Base-Simulation)] Explicitly set HTTP header 'Content-Type: application/json' is ignored, illegal RawHeader
[WARN] [12/14/2016 21:27:26.944] [Base-Simulation-akka.actor.default-dispatcher-7] [akka.actor.ActorSystemImpl(Base-Simulation)] Explicitly set HTTP header 'Content-Type: application/json' is ignored, illegal RawHeader

================================================================================
2016-12-14 21:27:32                                           0s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[                                                                          ]  0%
          waiting: 30     / active: 0      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=0      KO=0     )

================================================================================


================================================================================
2016-12-14 21:27:37                                           5s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=966    KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=966    KO=0     )
================================================================================


================================================================================
2016-12-14 21:27:42                                          10s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=2467   KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=2467   KO=0     )
================================================================================


================================================================================
2016-12-14 21:27:47                                          15s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=4053   KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=4053   KO=0     )
================================================================================


================================================================================
2016-12-14 21:27:52                                          20s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=5660   KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=5660   KO=0     )
================================================================================


================================================================================
2016-12-14 21:27:57                                          25s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=7305   KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=7305   KO=0     )
================================================================================


================================================================================
2016-12-14 21:28:02                                          30s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=8990   KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=8990   KO=0     )
================================================================================


================================================================================
2016-12-14 21:28:07                                          35s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=10743  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=10743  KO=0     )
================================================================================


================================================================================
2016-12-14 21:28:12                                          40s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=12477  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=12477  KO=0     )
================================================================================


================================================================================
2016-12-14 21:28:17                                          45s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=14150  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=14150  KO=0     )
================================================================================


================================================================================
2016-12-14 21:28:22                                          50s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=15462  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=15462  KO=0     )
================================================================================


================================================================================
2016-12-14 21:28:27                                          55s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=17219  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=17219  KO=0     )
================================================================================


================================================================================
2016-12-14 21:28:32                                          60s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=19023  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=19023  KO=0     )
================================================================================


================================================================================
2016-12-14 21:28:35                                          62s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[##########################################################################]100%
          waiting: 0      / active: 0      / done:30    
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=19669  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=19669  KO=0     )
================================================================================

Simulation finished
Stored in influxdb the monitoring part ElasticSearch - Before call
Stored in influxdb the monitoring part ElasticSearch - Call
Stored in influxdb the monitoring part ElasticSearch - After call
Monitoring is stored in influxdb
Opening http://localhost:3000/dashboard/db/daas-hetzner-hdw?from=1481747252256&to=1481747317833
Opening http://localhost:3000/dashboard/db/daas-hetzner-monitoring
Parsing log file(s)...
Parsing log file(s) done
Generating reports...

================================================================================
---- Global Information --------------------------------------------------------
> request count                                      19669 (OK=19669  KO=0     )
> min response time                                     54 (OK=54     KO=-     )
> max response time                                   1092 (OK=1092   KO=-     )
> mean response time                                    91 (OK=91     KO=-     )
> std deviation                                         38 (OK=38     KO=-     )
> response time 50th percentile                         84 (OK=84     KO=-     )
> response time 75th percentile                         95 (OK=95     KO=-     )
> mean requests/sec                                312.519 (OK=312.519 KO=-     )
---- Response Time Distribution ------------------------------------------------
> t < 800 ms                                         19648 (100%)
> 800 ms < t < 1200 ms                                  21 (  0%)
> t > 1200 ms                                            0 (  0%)
> failed                                                 0 (  0%)
================================================================================

Reports generated in 0s.
Please open the following file: /home/david/workspace/daas/testPF/target/gatling/results/esloadtestpostsearchsimulation30x1m-1481747252572/index.html
[INFO] ------------------------------------------------------------------------
[INFO] BUILD SUCCESS
[INFO] ------------------------------------------------------------------------
[INFO] Total time: 01:52 min
[INFO] Finished at: 2016-12-14T21:29:01+01:00
[INFO] Final Memory: 18M/319M
[INFO] ------------------------------------------------------------------------